city_dict = {
    '2021-08-03': [['金华市', 19], ['嘉兴市', 4], ['湖州市', 1], ['宁波市', 10], ['温州市', 19], ['台州市', 8], ['舟山市', 13], ['衢州市', 2],
                   ['绍兴市', 5], ['丽水市', 3], ['杭州市', 15]],
    '2021-08-04': [['金华市', 33], ['嘉兴市', 13], ['湖州市', 3], ['宁波市', 23], ['温州市', 101], ['台州市', 6], ['舟山市', 2], ['衢州市', 1],
                   ['绍兴市', 14], ['丽水市', 2], ['杭州市', 8]],
    '2021-08-05': [['金华市', 25], ['嘉兴市', 7], ['湖州市', 3], ['宁波市', 13], ['温州市', 43], ['台州市', 3], ['舟山市', 3], ['衢州市', 4],
                   ['绍兴市', 14], ['丽水市', 3], ['杭州市', 10]],
    '2021-08-06': [['金华市', 10], ['嘉兴市', 6], ['湖州市', 2], ['宁波市', 17], ['温州市', 26], ['台州市', 11], ['舟山市', 1], ['衢州市', 0],
                   ['绍兴市', 7], ['丽水市', 1], ['杭州市', 54]],
    '2021-08-07': [['金华市', 14], ['嘉兴市', 11], ['湖州市', 8], ['宁波市', 10], ['温州市', 33], ['台州市', 7], ['舟山市', 4], ['衢州市', 3],
                   ['绍兴市', 12], ['丽水市', 2], ['杭州市', 19]],
    '2021-08-08': [['金华市', 1], ['嘉兴市', 2], ['湖州市', 0], ['宁波市', 0], ['温州市', 10], ['台州市', 2], ['舟山市', 0], ['衢州市', 0],
                   ['绍兴市', 0], ['丽水市', 0], ['杭州市', 6]],
    '2021-08-09': [['金华市', 0], ['嘉兴市', 2], ['湖州市', 0], ['宁波市', 1], ['温州市', 9], ['台州市', 1], ['舟山市', 0], ['衢州市', 0],
                   ['绍兴市', 0], ['丽水市', 0], ['杭州市', 2]],
    '2021-08-10': [['金华市', 0], ['嘉兴市', 8], ['湖州市', 0], ['宁波市', 1], ['温州市', 2], ['台州市', 1], ['舟山市', 7], ['衢州市', 0],
                   ['绍兴市', 6], ['丽水市', 0], ['杭州市', 3]]
}

new_list = list()
for i in city_dict.keys():
    one_dict = dict()
    one_dict["time"] = i
    one_dict["data"] = []
    new_list.append(one_dict)
    for j in city_dict.values():
        for g in j:
            two_dict = dict()
            two_dict["name"] = g[0]
            two_dict["value"] = g[1]
            one_dict["data"].append(two_dict)

print(new_list)
